#+title: Лабораторная работа 2
#+LANGUAGE: ru
#+LATEX_CLASS: article
#+LATEX_CLASS_OPTIONS: [a4paper,fleqn,12pt]
#+options: toc:nil title:nil
#+property: header-args :noweb yes :eval no-export
#+property: header-args:julia :exports none
#+LATEX_HEADER: \usepackage[lmargin=15mm, rmargin=15mm, tmargin=2cm, bmargin=2cm]{geometry}
#+LATEX_HEADER: \usepackage{mathtools}
#+LATEX_HEADER: \DeclarePairedDelimiter{\lint}{(}{]}

\begin{titlepage}
  \Large
  \begin{center}
    Санкт-Петербургский\\
    Политехнический университет Петра Великого\\
    \vspace{10em}
    Математическая статистика\\
    \vspace{2em}
    \textbf{Отчёт по лабораторным работам 5-8}
  \end{center}
  \vspace{6em}
  \begin{flushright}
    Студент: Копнов Александр Александрович\\
    Преподаватель: Баженов Александр Николаевич\\
    Группа: 5030102/00101
  \end{flushright}
  \vspace{\fill}
  \begin{center}
    Санкт-Петербург\\
    2023
  \end{center}
\end{titlepage}
\tableofcontents
\listoffigures
\listoftables

** Выборочные коэффициенты корреляции

#+name: csv_to_org
#+begin_src emacs-lisp :exports none :eval never-export
(defun csv-to-table (file)
  (with-temp-buffer
    (erase-buffer)
    (insert-file file)
    (org-table-convert-region (point-min) (point-max) '(4))
    (buffer-string)))
#+end_src

#+name: charTable20
#+caption: Двумерное нормальное распределение, n=20
#+begin_src emacs-lisp :exports results :results raw :noweb yes :eval no-export
<<csv_to_org>>
(csv-to-table "./figs/char20.csv")
#+end_src

#+RESULTS: charTable20
#+caption: Двумерное нормальное распределение, n=20
| \rho=0.0    |       |        |       |
|          |   $r$ |  $r_S$ | $r_Q$ |
| E(z)     | 0.008 |  0.004 | 0.008 |
| $E(z^2)$ | 0.050 |  0.018 | 0.051 |
| D(z)     | 0.225 |  0.136 | 0.227 |
|          |       |        |       |
| \rho=0.5    |       |        |       |
|          |   $r$ |  $r_S$ | $r_Q$ |
| E(z)     | 0.477 |  0.007 | 0.449 |
| $E(z^2)$ | 0.261 |  0.019 | 0.238 |
| D(z)     | 0.184 |  0.137 | 0.192 |
|          |       |        |       |
| \rho=0.9    |       |        |       |
|          |   $r$ |  $r_S$ | $r_Q$ |
| E(z)     | 0.894 | -0.007 | 0.865 |
| $E(z^2)$ | 0.802 |  0.018 | 0.753 |
| D(z)     | 0.054 |  0.133 | 0.071 |
|          |       |        |       |

#+name: charTable60
#+caption: Двумерное нормальное распределение, n=60
#+begin_src emacs-lisp :exports results :results raw :noweb yes :eval no-export
<<csv_to_org>>
(csv-to-table "./figs/char60.csv")
#+end_src

#+RESULTS: charTable60
#+caption: Двумерное нормальное распределение, n=60
| \rho=0.0    |        |        |        |
|          |    $r$ |  $r_S$ |  $r_Q$ |
| E(z)     | -0.001 |  0.003 | -0.003 |
| $E(z^2)$ |  0.017 |  0.006 |  0.018 |
| D(z)     |  0.132 |  0.078 |  0.134 |
|          |        |        |        |
| \rho=0.5    |        |        |        |
|          |    $r$ |  $r_S$ |  $r_Q$ |
| E(z)     |  0.496 |  0.004 |  0.475 |
| $E(z^2)$ |  0.256 |  0.006 |  0.237 |
| D(z)     |  0.099 |  0.077 |  0.105 |
|          |        |        |        |
| \rho=0.9    |        |        |        |
|          |    $r$ |  $r_S$ |  $r_Q$ |
| E(z)     |  0.900 | -0.002 |  0.885 |
| $E(z^2)$ |  0.811 |  0.006 |  0.784 |
| D(z)     |  0.027 |  0.077 |  0.033 |
|          |        |        |        |

#+name: charTable100
#+caption: Двумерное нормальное распределение, n=100
#+begin_src emacs-lisp :exports results :results raw :noweb yes :eval no-export
<<csv_to_org>>
(csv-to-table "./figs/char100.csv")
#+end_src

#+RESULTS: charTable100
#+caption: Двумерное нормальное распределение, n=100
| \rho=0.0    |       |       |       |
|          |   $r$ | $r_S$ | $r_Q$ |
| E(z)     | 0.002 | 0.003 | 0.003 |
| $E(z^2)$ | 0.010 | 0.004 | 0.010 |
| D(z)     | 0.101 | 0.061 | 0.100 |
|          |       |       |       |
| \rho=0.5    |       |       |       |
|          |   $r$ | $r_S$ | $r_Q$ |
| E(z)     | 0.501 | 0.001 | 0.482 |
| $E(z^2)$ | 0.256 | 0.004 | 0.239 |
| D(z)     | 0.074 | 0.063 | 0.078 |
|          |       |       |       |
| \rho=0.9    |       |       |       |
|          |   $r$ | $r_S$ | $r_Q$ |
| E(z)     | 0.898 | 0.001 | 0.884 |
| $E(z^2)$ | 0.807 | 0.003 | 0.783 |
| D(z)     | 0.019 | 0.059 | 0.025 |
|          |       |       |       |

#+name: charTableMix
#+caption: Смесь двумерных нормальных распределений
#+begin_src emacs-lisp :exports results :results raw :noweb yes :eval no-export
<<csv_to_org>>
(csv-to-table "./figs/charMix.csv")
#+end_src

#+RESULTS: charTableMix
#+caption: Смесь двумерных нормальных распределений
| size=20   |       |        |       |
|           |   $r$ |  $r_S$ | $r_Q$ |
| E(z)      | 0.692 | -0.002 | 0.652 |
| $E(z^2)$  | 0.495 |  0.017 | 0.447 |
| D(z)      | 0.127 |  0.132 | 0.147 |
|           |       |        |       |
| size=60   |       |        |       |
|           |   $r$ |  $r_S$ | $r_Q$ |
| E(z)      | 0.702 |  0.003 | 0.678 |
| $E(z^2)$  | 0.496 |  0.006 | 0.465 |
| D(z)      | 0.065 |  0.078 | 0.074 |
|           |       |        |       |
| size=100  |       |        |       |
|           |   $r$ |  $r_S$ | $r_Q$ |
| E(z)      | 0.701 |  0.000 | 0.680 |
| $E(z^2)$  | 0.494 |  0.004 | 0.465 |
| D(z)      | 0.051 |  0.060 | 0.059 |
|           |       |        |       |

\pagebreak
** Проверка гипотезы о законе распределения генеральной совокупности. Метод хи-квадрат

Исследуем \(N(0,1)\), размер выборки 100:

Метод максимального правдоподобия: \[
  \hat{\mu} = -0.03\quad \hat{\sigma} = 0.973
\]

#+name: chiNormal
#+caption: 100 значений из нормального распределения
#+begin_src emacs-lisp :exports results :results raw :noweb yes :eval no-export
<<csv_to_org>>
(csv-to-table "./figs/chiNormal.csv")
#+end_src

#+RESULTS: chiNormal
#+caption: 100 значений из нормального распределения
|   i | $\Delta_i$         |   $n_i$ | $p_i$ |  $np_i$ | $n_i - np_i$ | $\frac{(n_i - np_i)^2}{np_i}$ |
|   1 | (-Inf,-2.57]  |   1.000 | 0.005 |   0.452 |        0.548 |                         0.665 |
|   2 | (-2.57,-1.59] |   5.000 | 0.049 |   4.946 |        0.054 |                         0.001 |
|   3 | (-1.59,-0.62] |  19.000 | 0.219 |  21.884 |       -2.884 |                         0.380 |
|   4 | (-0.62,0.36]  |  41.000 | 0.382 |  38.217 |        2.783 |                         0.203 |
|   5 | (0.36,1.33]   |  25.000 | 0.265 |  26.454 |       -1.454 |                         0.080 |
|   6 | (1.33,2.31]   |   9.000 | 0.072 |   7.238 |        1.762 |                         0.429 |
|   7 | (2.31,Inf]    |   0.000 | 0.008 |   0.808 |       -0.808 |                         0.808 |
| $\sum$ | -             | 100.000 | 1.000 | 100.000 |       -0.000 |                         2.565 |

Видно, что \(\chi^2_{B} < \chi^2_{0.95} \approx 14.67\), следовательно полагаем гипотезу о том,
что это распределение \(N(\hat{\mu},\hat{\sigma})\) верной.

Исследуем \(L(0,\frac{1}{\sqrt{2}})\), размер выборки 20:

Метод максимального правдоподобия: \[
  \hat{\mu} = 0.06\quad \hat{\sigma} = 0.581
\]
#+name: chiLaplace
#+caption: 20 значений из распределения Лапласа
#+begin_src emacs-lisp :exports results :results raw :noweb yes :eval no-export
<<csv_to_org>>
(csv-to-table "./figs/chiLaplace.csv")
#+end_src

#+RESULTS: chiLaplace
#+caption: 20 значений из распределения Лапласа
|   i | $\Delta_i$        |  $n_i$ | $p_i$ | $np_i$ | $n_i - np_i$ | $\frac{(n_i - np_i)^2}{np_i}$ |
|   1 | (-Inf,-0.83] |  1.000 | 0.063 |  1.268 |       -0.268 |                         0.057 |
|   2 | (-0.83,0.44] | 16.000 | 0.679 | 13.589 |        2.411 |                         0.428 |
|   3 | (0.44,1.7]   |  3.000 | 0.255 |  5.096 |       -2.096 |                         0.862 |
|   4 | (1.7,Inf]    |  0.000 | 0.002 |  0.046 |       -0.046 |                         0.046 |
| $\sum$ | -            | 20.000 | 1.000 | 20.000 |        0.000 |                         1.393 |

Видно, что \(\chi^2_{B} < \chi^2_{0.95} \approx 9.48\), следовательно полагаем гипотезу  о том,
что это распределение \(N(\hat{\mu},\hat{\sigma})\) верной.

Исследуем \(U(-\sqrt{3},\sqrt{3})\), размер выборки 20:

Метод максимального правдоподобия: \[
  \hat{\mu} = -0.11\quad \hat{\sigma} = 0.894
\]
#+name: chiUniform
#+caption: 20 значений из равномерного распределения
#+begin_src emacs-lisp :exports results :results raw :noweb yes :eval no-export
<<csv_to_org>>
(csv-to-table "./figs/chiUniform.csv")
#+end_src

#+RESULTS: chiUniform
#+caption: 20 значений из равномерного распределения
|   i | $\Delta_i$       |  $n_i$ | $p_i$ | $np_i$ | $n_i - np_i$ | $\frac{(n_i - np_i)^2}{np_i}$ |
|   1 | (-Inf,-1.6] |  1.000 | 0.043 |  0.850 |        0.150 |                         0.026 |
|   2 | (-1.6,0.05] |  7.000 | 0.427 |  8.538 |       -1.538 |                         0.277 |
|   3 | (0.05,1.7]  | 12.000 | 0.472 |  9.444 |        2.556 |                         0.692 |
|   4 | (1.7,Inf]   |  0.000 | 0.058 |  1.167 |       -1.167 |                         1.167 |
| $\sum$ | -           | 20.000 | 1.000 | 20.000 |        0.000 |                         2.162 |

Видно, что \(\chi^2_{B} < \chi^2_{0.95} \approx 9.48\), следовательно полагаем гипотезу  о том,
что это распределение \(N(\hat{\mu},\hat{\sigma})\) верной.

